paper3/campaign-1-platform-actuation/results/calibration/cachepart-fio-write-end.txt
cachewrite: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=psync, iodepth=1
fio-3.36
Starting 1 process
cachewrite: Laying out IO file (1 file / 2048MiB)

cachewrite: (groupid=0, jobs=1): err= 0: pid=81673: Wed Sep  9 05:17:54 2026
  write: IOPS=1116, BW=1116MiB/s (1171MB/s)(32.7GiB/30001msec); 0 zone resets
    clat (usec): min=267, max=4751, avg=850.05, stdev=168.66
     lat (usec): min=287, max=4810, avg=894.93, stdev=169.96
    clat percentiles (usec):
     |  1.00th=[  293],  5.00th=[  347], 10.00th=[  848], 20.00th=[  873],
     | 30.00th=[  881], 40.00th=[  889], 50.00th=[  889], 60.00th=[  898],
     | 70.00th=[  906], 80.00th=[  914], 90.00th=[  930], 95.00th=[  938],
     | 99.00th=[  947], 99.50th=[  963], 99.90th=[ 2089], 99.95th=[ 2343],
     | 99.99th=[ 2737]
   bw (  MiB/s): min= 1060, max= 2402, per=100.00%, avg=1117.86, stdev=251.42, samples=59
   iops        : min= 1060, max= 2402, avg=1117.86, stdev=251.42, samples=59
  lat (usec)   : 500=8.65%, 750=0.21%, 1000=90.86%
  lat (msec)   : 2=0.17%, 4=0.11%, 10=0.01%
  cpu          : usr=5.59%, sys=3.40%, ctx=33499, majf=0, minf=12
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,33494,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=1116MiB/s (1171MB/s), 1116MiB/s-1116MiB/s (1171MB/s-1171MB/s), io=32.7GiB (35.1GB), run=30001-30001msec

Disk stats (read/write):
  nvme1n1: ios=0/267492, sectors=0/68369344, merge=0/160, ticks=0/117904, in_queue=117905, util=91.15%