paper3/campaign-1-platform-actuation/results/calibration/cachepart-fio-write-start.txt
cachewrite: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=psync, iodepth=1
fio-3.36
Starting 1 process
cachewrite: Laying out IO file (1 file / 2048MiB)

cachewrite: (groupid=0, jobs=1): err= 0: pid=21213: Wed Sep  9 03:07:37 2026
  write: IOPS=1061, BW=1061MiB/s (1113MB/s)(31.1GiB/30001msec); 0 zone resets
    clat (usec): min=265, max=24603, avg=911.81, stdev=445.30
     lat (usec): min=271, max=24658, avg=941.44, stdev=448.16
    clat percentiles (usec):
     |  1.00th=[  297],  5.00th=[  355], 10.00th=[  453], 20.00th=[  889],
     | 30.00th=[  898], 40.00th=[  906], 50.00th=[  906], 60.00th=[  914],
     | 70.00th=[  922], 80.00th=[  930], 90.00th=[  938], 95.00th=[  947],
     | 99.00th=[ 3556], 99.50th=[ 3589], 99.90th=[ 3916], 99.95th=[ 4293],
     | 99.99th=[ 6259]
   bw (  MiB/s): min=  270, max= 2174, per=100.00%, avg=1061.86, stdev=287.25, samples=59
   iops        : min=  270, max= 2174, avg=1061.86, stdev=287.25, samples=59
  lat (usec)   : 500=10.64%, 750=0.74%, 1000=85.39%
  lat (msec)   : 2=0.93%, 4=2.21%, 10=0.09%, 50=0.01%
  cpu          : usr=3.62%, sys=3.05%, ctx=31844, majf=0, minf=11
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,31844,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=1061MiB/s (1113MB/s), 1061MiB/s-1061MiB/s (1113MB/s-1113MB/s), io=31.1GiB (33.4GB), run=30001-30001msec

Disk stats (read/write):
  nvme1n1: ios=0/254094, sectors=0/64987808, merge=0/72, ticks=0/125769, in_queue=125769, util=93.48%