paper3/campaign-1-platform-actuation/results/calibration/node-fio-read-end.txt
seqread: (g=0): rw=read, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=psync, iodepth=1
fio-3.36
Starting 1 process
seqread: Laying out IO file (1 file / 2048MiB)

seqread: (groupid=0, jobs=1): err= 0: pid=81584: Wed Sep  9 05:17:23 2026
  read: IOPS=1410, BW=1410MiB/s (1479MB/s)(41.3GiB/30001msec)
    clat (usec): min=488, max=2919, avg=708.60, stdev=70.40
     lat (usec): min=488, max=2919, avg=708.66, stdev=70.40
    clat percentiles (usec):
     |  1.00th=[  529],  5.00th=[  545], 10.00th=[  562], 20.00th=[  709],
     | 30.00th=[  717], 40.00th=[  725], 50.00th=[  734], 60.00th=[  734],
     | 70.00th=[  742], 80.00th=[  750], 90.00th=[  758], 95.00th=[  766],
     | 99.00th=[  783], 99.50th=[  783], 99.90th=[  799], 99.95th=[  816],
     | 99.99th=[ 1123]
   bw (  MiB/s): min= 1356, max= 1806, per=100.00%, avg=1411.56, stdev=145.34, samples=59
   iops        : min= 1356, max= 1806, avg=1411.56, stdev=145.34, samples=59
  lat (usec)   : 500=0.04%, 750=78.12%, 1000=21.83%
  lat (msec)   : 2=0.01%, 4=0.01%
  cpu          : usr=0.21%, sys=4.95%, ctx=42304, majf=0, minf=267
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=42303,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=1410MiB/s (1479MB/s), 1410MiB/s-1410MiB/s (1479MB/s-1479MB/s), io=41.3GiB (44.4GB), run=30001-30001msec

Disk stats (read/write):
  nvme1n1: ios=336497/427, sectors=86143232/4696, merge=0/124, ticks=148950/28, in_queue=148978, util=94.58%