paper3/campaign-1-platform-actuation/results/calibration/node-fio-write-end.txt
seqwrite: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=psync, iodepth=1
fio-3.36
Starting 1 process
seqwrite: Laying out IO file (1 file / 2048MiB)

seqwrite: (groupid=0, jobs=1): err= 0: pid=81409: Wed Sep  9 05:16:51 2026
  write: IOPS=1111, BW=1111MiB/s (1165MB/s)(32.6GiB/30001msec); 0 zone resets
    clat (usec): min=263, max=4673, avg=864.69, stdev=161.94
     lat (usec): min=279, max=4702, avg=899.26, stdev=163.58
    clat percentiles (usec):
     |  1.00th=[  302],  5.00th=[  371], 10.00th=[  865], 20.00th=[  881],
     | 30.00th=[  889], 40.00th=[  898], 50.00th=[  906], 60.00th=[  906],
     | 70.00th=[  914], 80.00th=[  922], 90.00th=[  930], 95.00th=[  938],
     | 99.00th=[  947], 99.50th=[  955], 99.90th=[ 2114], 99.95th=[ 2311],
     | 99.99th=[ 2737]
   bw (  MiB/s): min= 1058, max= 2328, per=100.00%, avg=1112.34, stdev=234.19, samples=59
   iops        : min= 1058, max= 2328, avg=1112.34, stdev=234.19, samples=59
  lat (usec)   : 500=7.77%, 750=0.38%, 1000=91.57%
  lat (msec)   : 2=0.16%, 4=0.11%, 10=0.01%
  cpu          : usr=4.42%, sys=3.23%, ctx=33337, majf=0, minf=12
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,33332,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=1111MiB/s (1165MB/s), 1111MiB/s-1111MiB/s (1165MB/s-1165MB/s), io=32.6GiB (35.0GB), run=30001-30001msec

Disk stats (read/write):
  nvme1n1: ios=0/266232, sectors=0/68042184, merge=0/745, ticks=0/120524, in_queue=120525, util=92.60%