paper3/campaign-1-platform-actuation/results/calibration/node-fio-write-start.txt
seqwrite: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=psync, iodepth=1
fio-3.36
Starting 1 process
seqwrite: Laying out IO file (1 file / 2048MiB)

seqwrite: (groupid=0, jobs=1): err= 0: pid=20715: Wed Sep  9 03:06:35 2026
  write: IOPS=1103, BW=1103MiB/s (1157MB/s)(32.3GiB/30001msec); 0 zone resets
    clat (usec): min=265, max=8067, avg=883.37, stdev=212.87
     lat (usec): min=272, max=8084, avg=905.64, stdev=213.78
    clat percentiles (usec):
     |  1.00th=[  310],  5.00th=[  379], 10.00th=[  889], 20.00th=[  906],
     | 30.00th=[  906], 40.00th=[  914], 50.00th=[  922], 60.00th=[  922],
     | 70.00th=[  930], 80.00th=[  930], 90.00th=[  938], 95.00th=[  947],
     | 99.00th=[  955], 99.50th=[  963], 99.90th=[ 2442], 99.95th=[ 5407],
     | 99.99th=[ 6521]
   bw (  MiB/s): min=  810, max= 2392, per=100.00%, avg=1104.47, stdev=229.33, samples=59
   iops        : min=  810, max= 2392, avg=1104.47, stdev=229.33, samples=59
  lat (usec)   : 500=7.26%, 750=0.33%, 1000=92.06%
  lat (msec)   : 2=0.18%, 4=0.09%, 10=0.08%
  cpu          : usr=2.83%, sys=3.21%, ctx=33102, majf=0, minf=12
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,33101,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=1103MiB/s (1157MB/s), 1103MiB/s-1103MiB/s (1157MB/s-1157MB/s), io=32.3GiB (34.7GB), run=30001-30001msec

Disk stats (read/write):
  nvme1n1: ios=0/265249, sectors=0/67820560, merge=0/135, ticks=0/130030, in_queue=130029, util=94.01%